# GetLoadContext Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalResourceLoadData..::..GetLoadContext Method
ExternalResourceLoadData Class See Also
---
Returns an object containing information about the context of the load operation.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public ExternalResourceLoadContext GetLoadContext()
```

Visual Basic
---
```text
Public Function GetLoadContext As ExternalResourceLoadContext
```

Visual C++
---
```text
public:
ExternalResourceLoadContext^ GetLoadContext()
```

# ### Return Value
An object containing information about the context of the load operation.
# See Also
ExternalResourceLoadData Class
Autodesk.Revit.DB Namespace